## Plan Result (stg-global)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"
        name                                         = "hmcts-aat"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-dn"
            name                = "div-dn"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-da"
            name                = "div-da"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-rfe"
            name                = "div-rfe"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-pfe"
            name                = "div-pfe"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/sscs-tribunals"
            name                = "sscs-tribunals"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/sscs-cor"
            name                = "sscs-cor"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/sscs-tya"
            name                = "sscs-tya"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-webapp"
            name                = "xui-webapp"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-manage-org"
            name                = "xui-manage-org"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-approve-org"
            name                = "xui-approve-org"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-register-org"
            name                = "xui-register-org"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/civil-citizen-ui"
            name                = "civil-citizen-ui"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/cmc"
            name                = "cmc"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/cmc-legal"
            name                = "cmc-legal"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fact"
            name                = "fact"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fact-admin"
            name                = "fact-admin"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/rpts"
            name                = "rpts"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/nfdiv"
            name                = "nfdiv"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/et-sya"
            name                = "et-sya"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/ia-aip"
            name                = "ia-aip"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/wa-proto-frontend"
            name                = "wa-proto-frontend"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/gateway-ccd"
            name                = "gateway-ccd"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/return-case-doc-ccd"
            name                = "return-case-doc-ccd"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/pcq"
            name                = "pcq"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/lau"
            name                = "lau"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/adoption"
            name                = "adoption"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/adoption-web"
            name                = "adoption-web"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/probate"
            name                = "probate"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/idam-web-public"
            name                = "idam-web-public"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/paybubble"
            name                = "paybubble"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/bar"
            name                = "bar"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fees-register"
            name                = "fees-register"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/idam-web-admin"
            name                = "idam-web-admin"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/idam-user-dashboard"
            name                = "idam-user-dashboard"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/ds-ui"
            name                = "ds-ui"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fis-ds-web"
            name                = "fis-ds-web"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/privatelaw"
            name                = "privatelaw"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/paymentoutcome-web"
            name                = "paymentoutcome-web"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }





        # (246 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1305,"Program":"tfcmt","SHA1":"","Target":"stg-global","Vars":{}} -->